{
  "en": {
    "title": "Fundamental Rights of Indian Citizens",
    "language": "Language",
    "articles": {
  "14": {
    "title": "Right to Equality",
    "explanation": "Every person shall be considered equal before the law. The government cannot discriminate against anyone based on religion, caste, gender, or place of birth. Example: If a rich person and a poor person commit the same crime, both should be treated equally under the law. This principle ensures that justice is blind to social status and promotes fairness in legal proceedings."
  },
  "15": {
    "title": "Prohibition of Discrimination",
    "explanation": "The government cannot discriminate against any citizen solely based on religion, race, caste, sex, or place of birth. Example: The government cannot prevent someone from entering public spaces like parks, schools, or hospitals because of their caste. This right extends to all spheres of public life, ensuring equal access to public facilities and services for all citizens."
  },
  "16": {
    "title": "Equality of Opportunity in Public Employment",
    "explanation": "Article 16 states that every citizen should have equal opportunity for government jobs. Discrimination based on religion, caste, gender (male or female), or place of birth is prohibited. For example, if a Hindu boy from Delhi and a Muslim girl from Kerala are both qualified, they have equal right to apply for a government job. The government cannot say 'only men can apply' or 'only people of this religion are eligible.' However, the Constitution also allows for affirmative action (reservation) for socially or educationally backward classes like Scheduled Castes (SC), Scheduled Tribes (ST), or Other Backward Classes (OBC). For instance, if there are 100 government jobs, some seats can be reserved for SC/ST/OBC candidates to promote social upliftment. This article thus balances equality of opportunity with social justice."
  },
  "17": {
    "title": "Abolition of Untouchability",
    "explanation": "Untouchability has been abolished, and its practice is a punishable offense. Example: If someone prevents another person from entering a temple because of their caste, they are violating the law. This provision was crucial in dismantling the caste-based hierarchical system and promoting social equality."
  },
  "18": {
    "title": "Abolition of Titles",
    "explanation": "The government cannot confer titles like 'Raja' or 'Nawab,' and citizens cannot accept titles from foreign governments. Example: A person cannot add titles like 'Sir' or 'Lord' to their name. This ensures that all citizens remain equal in status and prevents the creation of artificial social hierarchies."
  },
  "19": {
    "title": "Freedom of Speech and Expression",
    "explanation": "Every citizen has the right to freedom of speech, peaceful assembly, forming associations, moving freely throughout India, residing in any part of the country, and practicing any profession. Example: A person can express their views peacefully but cannot incite violence. These rights are fundamental to democracy but are subject to reasonable restrictions for public order, security, and morality."
  },
  "20": {
    "title": "Protection in Respect of Conviction for Offenses",
    "explanation": "A person cannot be punished twice for the same offense (double jeopardy) and cannot be compelled to testify against themselves (self-incrimination). Example: If someone is acquitted of a crime, they cannot be tried again for the same offense. This protects citizens from arbitrary state action and ensures fair legal procedures."
  },
  "21": {
    "title": "Protection of Life and Personal Liberty",
    "explanation": "Every person has the right to life and personal liberty as per the procedure established by law. Example: The government cannot arrest someone without following proper legal procedures. This article has been widely interpreted by courts to include various rights like the right to privacy, clean environment, and dignified living."
  },
  "22": {
    "title": "Protection Against Arrest and Detention",
    "explanation": "A person must be informed of their rights at the time of arrest and has the right to legal assistance. Example: If someone is arrested, they must be presented before a magistrate within 24 hours. This prevents unlawful detention and ensures due process."
  },
  "23": {
    "title": "Prohibition of Human Trafficking and Forced Labor",
    "explanation": "Human trafficking, begging, and forced labor are punishable offenses. Example: If someone forces children to work, they are violating the law. This provision aims to protect the dignity of individuals and prevent exploitation."
  },
  "24": {
    "title": "Prohibition of Child Labor",
    "explanation": "Children below 14 years cannot be employed in hazardous industries. Example: A factory cannot make a 12-year-old child work. This recognizes children's right to education and protection from exploitation."
  },
  "25": {
    "title": "Freedom of Religion",
    "explanation": "Every person has the freedom to profess, practice, and propagate their religion. Example: A person can worship at a temple, mosque, church, or gurudwara. This right allows individuals to follow their conscience while maintaining public order."
  },
  "26": {
    "title": "Freedom to Manage Religious Affairs",
    "explanation": "Every religious denomination has the right to manage its own religious affairs. Example: A temple committee can make rules for its temple's administration. This protects religious autonomy while ensuring such practices don't violate other fundamental rights."
  },
  "27": {
    "title": "Freedom from Taxation for Religious Promotion",
    "explanation": "No person can be compelled to pay taxes for the promotion of any particular religion. Example: The government cannot collect taxes from citizens for building a temple. This maintains the secular character of the state."
  },
  "28": {
    "title": "Freedom from Religious Instruction in Certain Educational Institutions",
    "explanation": "Government-funded educational institutions cannot provide religious instruction, though private institutions may. Example: A government school cannot teach religious texts, but a private school can. This ensures state neutrality in religious matters."
  },
  "29": {
    "title": "Protection of Interests of Minorities",
    "explanation": "Every citizen has the right to conserve their distinct language, script, or culture. Example: Tamil-speaking people can run schools to preserve their language and culture. This protects India's cultural diversity."
  },
  "30": {
    "title": "Right of Minorities to Establish Educational Institutions",
    "explanation": "Religious and linguistic minorities have the right to establish and administer educational institutions of their choice. Example: The Christian community can run their own schools and colleges. This empowers minorities to preserve their identity through education."
  }

    }
  },
  "hi": {
    "title": "भारतीय नागरिकों के मौलिक अधिकार",
    "language": "भाषा",
    "articles": {
      "14": {
        "title": "समानता का अधिकार",
        "explanation": "हर व्यक्ति को कानून के सामने समान माना जाएगा। सरकार किसी के साथ धर्म, जाति, लिंग, या जन्म स्थान के आधार पर भेदभाव नहीं कर सकती। उदाहरण: अगर एक अमीर और एक गरीब व्यक्ति एक ही अपराध करते हैं, तो दोनों के साथ समान व्यवहार होना चाहिए।"
      },
      "15": {
        "title": "भेदभाव का निषेध",
        "explanation": "सरकार किसी नागरिक के साथ केवल धर्म, जाति, लिंग, या जन्म स्थान के आधार पर भेदभाव नहीं कर सकती। उदाहरण: सरकार सार्वजनिक स्थानों जैसे पार्क, स्कूल, या अस्पताल में किसी को उसकी जाति के कारण प्रवेश से नहीं रोक सकती।"
      },
      "16": {
        "title": "सार्वजनिक रोजगार में समान अवसर",
        "explanation": "अनुच्छेद 16 कहता है कि हर नागरिक को सरकारी नौकरियों के लिए बराबरी का मौका मिलना चाहिए। किसी के साथ धर्म, जाति, लिंग (लड़का या लड़की), या जन्म स्थान के आधार पर भेदभाव नहीं किया जा सकता। उदाहरण के लिए, अगर दिल्ली का एक हिंदू लड़का और केरल की एक मुस्लिम लड़की दोनों ही योग्य हैं, तो दोनों को सरकारी नौकरी के लिए आवेदन करने का बराबर अधिकार है। सरकार यह नहीं कह सकती कि “सिर्फ पुरुष ही आवेदन कर सकते हैं” या “सिर्फ इस धर्म के लोग ही योग्य हैं। लेकिन संविधान यह भी कहता है कि जो लोग सामाजिक या शैक्षिक रूप से पिछड़े हैं, जैसे कि अनुसूचित जाति (SC), अनुसूचित जनजाति (ST), या अन्य पिछड़ा वर्ग (OBC), उन्हें आगे बढ़ाने के लिए आरक्षण दिया जा सकता है। उदाहरण के लिए, अगर 100 सरकारी नौकरियां हैं, तो सरकार कुछ सीटें SC/ST/OBC के लिए आरक्षित कर सकती है, ताकि वे भी आगे बढ़ सकें। इस तरह, अनुच्छेद 16 यह सुनिश्चित करता है कि सभी को सरकारी नौकरी में समान अवसर और न्याय मिले।"
      },
      "17": {
        "title": "अस्पृश्यता का उन्मूलन",
        "explanation": "अस्पृश्यता को समाप्त किया गया है, और इसका पालन करना कानूनन अपराध है। उदाहरण: अगर कोई व्यक्ति किसी को उसकी जाति के कारण मंदिर में प्रवेश से रोकता है, तो वह कानून का उल्लंघन करता है।"
      },
      "18": {
        "title": "शीर्षकों का उन्मूलन",
        "explanation": "सरकार किसी को \"राजा\", \"नवाब\" जैसी उपाधियाँ नहीं दे सकती, और नागरिक विदेशी सरकारों से उपाधियाँ स्वीकार नहीं कर सकते। उदाहरण: कोई व्यक्ति अपने नाम के साथ \"सर\" या \"लॉर्ड\" जैसी उपाधि नहीं जोड़ सकता।"
      },
      "19": {
        "title": "भाषण और अभिव्यक्ति की स्वतंत्रता",
        "explanation": "हर नागरिक को अभिव्यक्ति की स्वतंत्रता, शांतिपूर्ण सभा, संगठन बनाने, भारत में कहीं भी घूमने, बसने, और किसी भी पेशे को अपनाने का अधिकार है। उदाहरण: कोई व्यक्ति अपने विचारों को शांति से व्यक्त कर सकता है, लेकिन हिंसा नहीं कर सकता।"
      },
      "20": {
        "title": "अपराध के लिए सजा में सुरक्षा",
        "explanation": "किसी व्यक्ति को उसी अपराध के लिए दो बार सजा नहीं दी जा सकती, और उसे खुद को दोषी मानने के लिए मजबूर नहीं किया जा सकता। उदाहरण: अगर किसी को एक अपराध के लिए बरी कर दिया गया है, तो उसे उसी अपराध के लिए फिर से सजा नहीं दी जा सकती।"
      },
      "21": {
        "title": "जीवन और व्यक्तिगत स्वतंत्रता का संरक्षण",
        "explanation": "हर व्यक्ति को कानून द्वारा निर्धारित प्रक्रिया के अनुसार जीवन और व्यक्तिगत स्वतंत्रता का अधिकार है। उदाहरण: सरकार किसी को बिना उचित कानूनी प्रक्रिया के गिरफ्तार नहीं कर सकती।"
      },
      "22": {
        "title": "गिरफ्तारी और हिरासत से सुरक्षा",
        "explanation": "गिरफ्तारी के समय व्यक्ति को उसके अधिकारों की जानकारी दी जानी चाहिए, और उसे वकील की सहायता का अधिकार है। उदाहरण: अगर किसी को गिरफ्तार किया जाता है, तो उसे 24 घंटे के भीतर मजिस्ट्रेट के सामने पेश किया जाना चाहिए।"
      },
      "23": {
        "title": "मानव तस्करी और जबरन श्रम का निषेध",
        "explanation": "मानव तस्करी, भीख मंगवाना, और जबरन श्रम कराना कानूनन अपराध है। उदाहरण: अगर कोई व्यक्ति बच्चों से जबरन काम करवाता है, तो वह कानून का उल्लंघन करता है।"
      },
      "24": {
        "title": "बच्चों के रोजगार का निषेध",
        "explanation": "14 वर्ष से कम उम्र के बच्चों को खतरनाक उद्योगों में काम पर नहीं लगाया जा सकता। उदाहरण: कोई फैक्ट्री 12 साल के बच्चे से काम नहीं करवा सकती।"
      },
      "25": {
        "title": "धर्म की स्वतंत्रता",
        "explanation": "हर व्यक्ति को अपने धर्म का पालन, प्रचार, और अभ्यास करने की स्वतंत्रता है। उदाहरण: कोई व्यक्ति मंदिर, मस्जिद, चर्च, या गुरुद्वारे में जाकर पूजा कर सकता है।"
      },
      "26": {
        "title": "धार्मिक मामलों के प्रबंधन की स्वतंत्रता",
        "explanation": "हर धार्मिक संप्रदाय को अपने धार्मिक मामलों का प्रबंधन करने का अधिकार है। उदाहरण: एक मंदिर समिति अपने मंदिर के संचालन के लिए नियम बना सकती है।"
      },
      "27": {
        "title": "किसी धर्म के प्रचार के लिए कर न देने की स्वतंत्रता",
        "explanation": "कोई व्यक्ति सरकार द्वारा किसी विशेष धर्म के प्रचार के लिए कर देने के लिए मजबूर नहीं किया जा सकता। उदाहरण: सरकार किसी नागरिक से मंदिर निर्माण के लिए कर नहीं वसूल सकती।"
      },
      "28": {
        "title": "कुछ शैक्षणिक संस्थानों में धार्मिक शिक्षा से स्वतंत्रता",
        "explanation": "सरकारी वित्तपोषित शैक्षणिक संस्थानों में धार्मिक शिक्षा नहीं दी जा सकती, लेकिन निजी संस्थानों में दी जा सकती है। उदाहरण: सरकारी स्कूल में धार्मिक पाठ नहीं पढ़ाया जा सकता, लेकिन निजी स्कूल में पढ़ाया जा सकता है।"
      },
      "29": {
        "title": "अल्पसंख्यकों के हितों की सुरक्षा",
        "explanation": "हर नागरिक को अपनी भाषा, लिपि, और संस्कृति को संरक्षित करने का अधिकार है।उदाहरण: तमिल भाषी लोग अपनी भाषा और संस्कृति को बनाए रखने के लिए स्कूल चला सकते हैं।"
      },
      "30": {
        "title": "अल्पसंख्यकों को शैक्षणिक संस्थान स्थापित करने का अधिकार",
        "explanation": "धार्मिक और भाषाई अल्पसंख्यकों को अपनी पसंद के शैक्षणिक संस्थान स्थापित और प्रबंधित करने का अधिकार है। उदाहरण: ईसाई समुदाय अपने स्कूल और कॉलेज चला सकता है।"
      }
    }
  },
  "ta": {
    "title": "இந்திய குடிமக்களின் அடிப்படை உரிமைகள்",
    "language": "மொழி",
    "articles": {
      "14": {
        "title": "சமத்துவ உரிமை",
        "explanation": "எல்லா குடிமக்களும் சட்டம் முன்னிலையில் சமமாக இருப்பார்கள் மற்றும் வேறுபாடின்றி சம பாதுகாப்பை பெறுவர்."
      },
      "15": {
        "title": "பல்வேறு அடிப்படையில் வேறுபாடு செய்யுதல் தடைசெய்யப்பட்டது",
        "explanation": "அரசு எந்தவொரு குடிமகனையும் மதம், இனம், சாதி, பாலினம் அல்லது பிறப்பிடத்தின் அடிப்படையில் வேறுபாடு செய்யக் கூடாது."
      },
      "16": {
        "title": "பொது வேலைகளில் சம வாய்ப்பு",
        "explanation": "ஒவ்வொரு குடிமகனுக்கும் அரசில் வேலை பெற சம வாய்ப்பு உள்ளது."
      },
      "17": {
        "title": "அசூயக்குறிப்பினை அகற்றுதல்",
        "explanation": "அசூயக்குறிப்பு எந்தவிதமாகவும் தடைசெய்யப்பட்டுள்ளது மற்றும் தண்டிக்கப்பட வேண்டும்."
      },
      "18": {
        "title": "பதவிப் பட்டங்களை அகற்றுதல்",
        "explanation": "அரசு எந்த பதவியையும் தரக் கூடாது, படை மற்றும் கல்வி பதவிகள் தவிர."
      },
      "19": {
        "title": "பேச்சு மற்றும் வெளிப்பாட்டு சுதந்திரம்",
        "explanation": "குடிமக்கள் தங்களுடைய கருத்துக்களை சுதந்திரமாக வெளிப்படுத்த உரிமை பெற்றுள்ளனர், சில நியாயமான வரம்புகளுடன்."
      },
      "20": {
        "title": "வழக்குகளுக்கான பாதுகாப்பு",
        "explanation": "சட்டப்படி தவிர வேறு முறையில் எந்த குடிமகனும் குற்றவாளியாக அறிவிக்கப்பட மாட்டான்."
      },
      "21": {
        "title": "வாழ்க்கை மற்றும் தனிப்பட்ட சுதந்திரம் பாதுகாப்பு",
        "explanation": "ஒருவரின் வாழ்க்கை மற்றும் தனிப்பட்ட சுதந்திரம் சட்டப்படி நிர்ணயிக்கப்பட்ட முறையின் கீழ் மட்டுமே விருப்பமின்றி எடுத்துக்கொள்ளப்படலாம்."
      },
      "22": {
        "title": "கைதியிடுதல் மற்றும் பிடிப்பில் பாதுகாப்பு",
        "explanation": "அநியாயமான கைதியிடுதல் மற்றும் பிடிப்பிலிருந்து பாதுகாப்பு வழங்கப்படும்."
      },
      "23": {
        "title": "மனிதக் கடத்தல் மற்றும் பலவீனப்படுத்தப்பட்ட தொழிலுக்கு தடை",
        "explanation": "மனிதக் கடத்தல் மற்றும் பலவீனப்படுத்தப்பட்ட தொழில் தடைசெய்யப்பட்டுள்ளது."
      },
      "24": {
        "title": "குழந்தைகள் வேலை செய்யும் தடை",
        "explanation": "14 வயதுக்கு கீழ் குழந்தைகளை தொழிற்சாலைகள், சுரங்கங்கள் அல்லது ஆபத்தான வேலைகளில் வேலை செய்ய விடக் கூடாது."
      },
      "25": {
        "title": "மத சுதந்திரம்",
        "explanation": "எல்லா குடிமக்களும் தங்களுடைய மதத்தை சுதந்திரமாக ஒப்புக்கொள்ள, பழக, பரப்ப உரிமை பெற்றுள்ளனர்."
      },
      "26": {
        "title": "மத காரியங்களை நிர்வகிக்கும் சுதந்திரம்",
        "explanation": "மத சமுதாயங்கள் தங்களுடைய காரியங்களை நிர்வகிக்கும் உரிமை உள்ளன."
      },
      "27": {
        "title": "ஏதாவது ஒரு மதத்திற்கு பணம் செலுத்த வேண்டாமை",
        "explanation": "ஒரு நபர் எந்த மதத்திற்கும் நிதி கொடுக்க கட்டாயப்படுத்தப்பட மாட்டார்."
      },
      "28": {
        "title": "கல்வி நிறுவனங்களில் மதப் போதனை இல்லாமை",
        "explanation": "சரকারு நிதியளிக்கும் கல்வி நிறுவனங்களில் மதப் போதனை வழங்கப்பட மாட்டாது."
      },
      "29": {
        "title": "சிறுபான்மையினரின் உரிமைகள் பாதுகாப்பு",
        "explanation": "சிறுபான்மையினர்கள் தங்கள் மொழி, எழுத்து மற்றும் பண்பாட்டை பாதுகாக்க உரிம"
      }
    }
  }
}
